ExprovipFuel/src/DataProcessors/ОбъединениеНоменклатуры/ОбъединениеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбъединениеНоменклатуры</name>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>НоменкатураИсточник</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПриемник</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ExprovipFuel/src/DataProcessors/ОбъединениеНоменклатуры/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПеренестиИдентификаторыКодовПоставщиков(Команда)
	ПеренестиИдентификаторыКодовПоставщиковНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПеренестиИдентификаторыКодовПоставщиковНаСервере()
	КоличествоДобавленныхСтрок = 0;
	КоличествоИзмененныхЭлементов = 0;
	
	Для Каждого СтрокаНоменклатуры Из Объект.Номенклатура Цикл
		Если Не ЗначениеЗаполнено(СтрокаНоменклатуры.НоменкатураИсточник)
			Или Не ЗначениеЗаполнено(СтрокаНоменклатуры.НоменклатураПриемник) Тогда
			Продолжить;
		КонецЕсли;
		
		НоменклатураИсточник = СтрокаНоменклатуры.НоменкатураИсточник.ПолучитьОбъект();
		НоменклатураПриемник = СтрокаНоменклатуры.НоменклатураПриемник.ПолучитьОбъект();
		ПриемникИзменен = Ложь;
		
		Для Каждого ИдентификаторИсточника Из НоменклатураИсточник.ИдентификаторыКодовПоставщиков Цикл
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Контрагент", ИдентификаторИсточника.Контрагент);
			ПараметрыПоиска.Вставить("ИД", ИдентификаторИсточника.ИД);
			ПараметрыПоиска.Вставить("Комментарий77", ИдентификаторИсточника.Комментарий77);
			
			Если НоменклатураПриемник.ИдентификаторыКодовПоставщиков.НайтиСтроки(ПараметрыПоиска).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйИдентификатор = НоменклатураПриемник.ИдентификаторыКодовПоставщиков.Добавить();
			НовыйИдентификатор.Контрагент = ИдентификаторИсточника.Контрагент;
			НовыйИдентификатор.ИД = ИдентификаторИсточника.ИД;
			НовыйИдентификатор.Комментарий77 = ИдентификаторИсточника.Комментарий77;
			
			КоличествоДобавленныхСтрок = КоличествоДобавленныхСтрок + 1;
			ПриемникИзменен = Истина;
		КонецЦикла;
		
		Если ПриемникИзменен Тогда
			НоменклатураПриемник.Записать();
			КоличествоИзмененныхЭлементов = КоличествоИзмененныхЭлементов + 1;
		КонецЕсли;
	КонецЦикла;
	
	ТекстСообщения = СтрШаблон(
		"Перенос идентификаторов кодов поставщиков завершен. Изменено элементов: %1. Добавлено строк: %2.",
		КоличествоИзмененныхЭлементов,
		КоличествоДобавленныхСтрок);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры
#КонецОбласти
